0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet      (0 10 0);
Ucondenser  (0 0 20);
Ugenerator  (0 0 15);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }
    "(condenser_.*)"
    {
        type            fixedValue;
        value           uniform $Ucondenser;
    }
    "(generator_.*)"
    {
        type            fixedValue;
        value           uniform $Ugenerator;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
