0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions        [0 2 -2 0 0 0 0]; //[1 -1 -2 0 0 0 0]; //m2/s2 [0 2 -2 0 0 0 0];, From fvDOM tut: [1 -1 -2 0 0 0 0]; kg/ms2

internalField   uniform 0;

boundaryField
{

    "(building|generator|condenser|ground)"
    {
        type            fixedFluxPressure;
        value           uniform $internalField;
    }
    "(inlet|.*_in|.*_out)"
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           uniform 0;
    }
    slips
    {
        type            symmetry;
    }
}

// ************************************************************************* //
