system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    EXT_BLDG_EQUIP.stl
    {
        type triSurfaceMesh;
        name obstructions;
        scale 0.001;
        regions
        {
            building
            {
                name building;
            }
            generator 
            {
                name generator;
            }
            condenser
            {
                name condenser;
            }
        }
    }
    BCs_EXT_BLDG_EQUIP.stl
    {
        type triSurfaceMesh;
        name BCs;
        scale 0.001;
        regions
        {
            condenser_in
            {
                name condenser_in;
            }
            condenser_out
            {
                name condenser_out;
            }
            generator_in
            {
                name generator_in;
            }
            generator_out
            {
                name generator_out;
            }
        }
    }
    surrounding_refinement
    {
        type searchableBox;
        min  (-5 -30 0);
        max  ( 25 100 15);
    }
    generator_refinement
    {
        type searchableBox;
        min  (6 -26 0);
        max  ( 14 -8 7);
    }
    condenser_refinement
    {
        type searchableBox;
        min  (6 19 10);
        max  ( 14 31 15);
    }
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    features
    (
      /*{ file  "obstructions.eMesh"; level 1; }*/
    );

    refinementSurfaces
    {
        obstructions
        {
            level (2 2);
            patchInfo { type wall; }     //inGroups (obstructions);

        }
        BCs
        {
            level (4 4);
            patchInfo { type patch; }
        }
        building
        {
            level (3 3);
            patchInfo { type wall; }
        }
        generator
        {
            level (4 4);
            patchInfo { type wall; }
        }
        condenser
        {
            level (4 4);
            patchInfo { type wall; }
        }
        condenser_in
        {
            level (4 4);
            patchInfo { type patch;}
        }
        condenser_out
        {
            level (4 4);
            patchInfo { type patch;}
        }
        generator_in
        {
            level (4 4);
            patchInfo { type patch;}
        }
        generator_out
        {
            level (4 4);
            patchInfo { type patch;} 
        }
    }

    refinementRegions
    {
        surrounding_refinement
        {
            mode inside;
            levels ((1E15 2));
        }
        generator_refinement
        {
            mode inside;
            levels ((1E15 4));
        }
        condenser_refinement
        {
            mode inside;
            levels ((1E15 4));
        }
    }

    locationInMesh (-.13 -.12 .11);
    //allowFreeStandingZoneFaces true;
}

snapControls
{
    explicitFeatureSnap    false;
    implicitFeatureSnap    true;
}

addLayersControls
{
    layers
    {
        "(building|generator|condenser|ground|wall)"
        {
            nSurfaceLayers 4;
        }
    }

    relativeSizes       true;
    expansionRatio      1.1;
    finalLayerThickness .25;
    minThickness        .05;

    //Advanced
/*    featureAngle 110;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.9;
    maxThicknessToMedialRatio 0.9;
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;*/
}

meshQualityControls
{
    #include "meshQualityDict"
    nSmoothScale 4;
    errorReduction 0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
